<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Audacity disk image and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.thohmann.filewave.mypicturemaxx5</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>my-picturemaxx-5</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.thohmann.download.mypicturemaxx5</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/components</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%app_name%</string>
				<key>source_path</key>
				<string>%pathname%/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/components/Applications/%app_name%</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>fw_app_bundle_id</string>
					<key>CFBundleShortVersionString</key>
					<string>fw_app_version_short</string>
					<key>CFBundleGetInfoString</key>
					<string>fw_app_version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path</key>
				<string>%RECIPE_CACHE_DIR%/components/Applications/%app_name%</string>
				<key>user</key>
				<string>root</string>
				<key>group</key>
				<string>admin</string>
			</dict>
			<key>Processor</key>
			<string>com.github.thohmann.pathchown/PathCHOWN</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_name</key>
				<string>my-picturemaxx</string>
				<key>fw_destination_root</key>
				<string>/Applications/%app_name%.app</string>
				<key>fw_fileset_name</key>
				<string>%fw_name% %fw_app_version% ab macOS 10 (Programm)</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path</key>
				<string>%RECIPE_CACHE_DIR%/components/Applications/%app_name%</string>
				<key>user</key>
				<string>me</string>
				<key>group</key>
				<string>admin</string>
			</dict>
			<key>Processor</key>
			<string>com.github.thohmann.pathchown/PathCHOWN</string>
		</dict>
	</array>
</dict>
</plist>
