<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Aploris.</string>
    <key>Identifier</key>
    <string>com.github.thohmann.download.Aploris</string>
    <key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>http://www.aploris.com/downloads/mac?43IZP</string>
		<key>NAME</key>
		<string>Aploris Charts for Microsoft PowerPoint</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
    </array>
</dict>
</plist>