Description: Downloads the latest Audacity disk image and imports into FileWave.
Identifier: com.github.thohmann.filewave.Audacity.Intel
ParentRecipe: com.github.dataJAR-recipes.download.Audacity
MinimumVersion: 0.2.0

Input:
  NAME: Audacity
  fw_destination_root: '/Applications/%NAME%.app'
  fw_architecture: 'Intel'
  ARCHITECTURE: 'x86_64'
  
Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/components'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/%app_name%'
    source_path: '%pathname%/%app_name%'

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/components/Applications/%app_name%'
    plist_keys:
      CFBundleIdentifier: app_bundle_id
      CFBundleShortVersionString: fw_app_version
      LSMinimumSystemVersion: fw_app_minsysversion

- Processor: com.github.thohmann.pathchown/PathCHOWN
  Arguments:
    group: admin
    path: '%RECIPE_CACHE_DIR%/components/Applications/%app_name%'
    user: root

- Processor: com.github.autopkg.filewave.FWTool/FileWaveImporter
  Arguments:
    fw_app_bundle_id: '%app_bundle_id%.%fw_architecture%'
    fw_fileset_name: '%NAME% %fw_app_version% ab macOS %fw_app_minsysversion% %fw_architecture% (Programm)'
    fw_import_source: '%pkgroot%/Applications/%app_name%'

- Processor: com.github.thohmann.pathchown/PathCHOWN
  Arguments:
    group: admin
    path: '%RECIPE_CACHE_DIR%/components/Applications/%app_name%'
    user: me
    