<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Adobe Flash Player installer and extracts the embedded package. No repackaging done.</string>
    <key>Identifier</key>
    <string>com.github.thohmann.filewave.FlashPlayer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Adobe FlashPlayer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.FlashPlayer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Get Adobe Flash version from the pkg</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Install Adobe Flash Player.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy the embedded package out of the application bundle in the disk image.</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/Install Adobe Flash Player.app/Contents/Resources/Adobe Flash Player.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Downloads/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
        <dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/AdobeFlashPlayerComponent.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Components</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/Components/Library/LaunchDaemons</string>
                    <string>%RECIPE_CACHE_DIR%/Components/Library/LaunchAgents</string>
                </array>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.thohmann.ExternalScriptRunner/ExternalScriptRunner</string>
			<key>Arguments</key>
			<dict>
				<key>EXT_SCRIPT_PATH</key>
				<string>%RECIPE_CACHE_DIR%/unpack/AdobeFlashPlayerComponent.pkg/Scripts/finalize</string>
				<key>EXT_SCRIPT_ARGS</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/Components</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/Components/Library/Internet Plug-Ins/Flash Player.plugin/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path</key>
				<string>%RECIPE_CACHE_DIR%/Components</string>
				<key>user</key>
				<string>root</string>
				<key>group</key>
				<string>admin</string>
			</dict>
			<key>Processor</key>
			<string>com.github.thohmann.pathchown/PathCHOWN</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%bundleid%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% %version% ab macOS 10.6 (Plugin)</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/Components</string>
				<key>fw_destination_root</key>
        		<string>/</string>				
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path</key>
				<string>%RECIPE_CACHE_DIR%/Components</string>
				<key>user</key>
				<string>me</string>
				<key>group</key>
				<string>admin</string>
			</dict>
			<key>Processor</key>
			<string>com.github.thohmann.pathchown/PathCHOWN</string>
		</dict>
    </array>
</dict>
</plist>
