<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Mattermost and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.thohmann.filewave.Mattermost</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mattermost</string>
        <key>fw_destination_root</key>
        <string>/Applications/%NAME%.app</string>
        <key>os</key>
		<string>mac-universal</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.Mattermost</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%app_name%</string>
				<key>source_path</key>
				<string>%pathname%/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
                <key>requirement</key>
                <string>identifier "Mattermost.Desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UQ8HT4Q2XM</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>fw_app_bundle_id</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
					<key>LSMinimumSystemVersion</key>
					<string>fw_app_minsysversion</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>user</key>
				<string>root</string>
				<key>group</key>
				<string>admin</string>
			</dict>
			<key>Processor</key>
			<string>com.github.thohmann.pathchown/PathCHOWN</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% %version% ab macOS %fw_app_minsysversion% (Programm)</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>user</key>
				<string>me</string>
				<key>group</key>
				<string>admin</string>
			</dict>
			<key>Processor</key>
			<string>com.github.thohmann.pathchown/PathCHOWN</string>
		</dict>
	</array>
</dict>
</plist>
