<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads CrowdStrike Falcon sensor based on policy and imports into FileWave.

Das PKG wird in den Ordner /var/scripts/.fw_common/Crowdstrike/ im Fileset importiert.
Dies ermöglicht die Verwendung des PKG in Post-Flight Scripts für Revisionen.

Credentials müssen vorher in der Keychain gespeichert werden:
    python3 setup_crowdstrike_keychain.py
</string>
    <key>Identifier</key>
    <string>com.github.thohmann.filewave.CrowdStrikeFalcon</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CrowdStrike Falcon Sensor</string>
        <key>CLOUD</key>
        <string>eu-1</string>
        <key>PLATFORM</key>
        <string>Mac</string>
        <key>POLICY_NAME</key>
        <string>platform_default</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.thohmann.download.CrowdStrikeFalcon</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/components</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/components/FalconSensorMacOS_%version%_Install.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.thohmann.processors/PathCHOWN</string>
            <key>Arguments</key>
            <dict>
                <key>path</key>
                <string>%RECIPE_CACHE_DIR%/components</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.thohmann.processors/FileWaveImporter</string>
            <key>Arguments</key>
            <dict>
                <key>fw_destination_root</key>
                <string>/var/scripts/.fw_common/Crowdstrike</string>
                <key>fw_import_source</key>
                <string>%RECIPE_CACHE_DIR%/components</string>
                <key>fw_app_bundle_id</key>
                <string>com.crowdstrike.falcon.Agent</string>
                <key>fw_app_version</key>
                <string>%version%</string>
                <key>fw_fileset_name</key>
                <string>%NAME% %version% (PKG-Datei für Revision)</string>
                <key>fw_fileset_group</key>
                <string>#Labor Revisionen</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.thohmann.processors/PathCHOWN</string>
            <key>Arguments</key>
            <dict>
                <key>path</key>
                <string>%RECIPE_CACHE_DIR%/components</string>
                <key>user</key>
                <string>me</string>
                <key>group</key>
                <string>admin</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/components</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>