<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Teamviewer QS Burda from the release page</string>
    <key>Identifier</key>
    <string>com.github.thohmann.download.teamviewerqsburda</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TeamViewerQS</string>
        <key>DOWNLOAD_URL</key>
        <string>https://customdesignservice.teamviewer.com/download/mac/v15/hdburmu/TeamViewerQS.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.teamviewer.TeamViewerQS" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "H7UGFBUGV6")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
