<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft 365 Copilot installer package.</string>
	<key>Identifier</key>
	<string>com.github.thohmann.download.microsoft365copilot</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOADURL</key>
		<string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
		<key>NAME</key>
		<string>Microsoft 365 Copilot</string>
		<key>PRODUCTID</key>
		<string>2325438</string>
		<key>SOFTWARETITLE</key>
		<string>M365Copilot</string>
		<key>VENDOR</key>
		<string>Microsoft</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%VENDOR%_%SOFTWARETITLE%.pkg</string>
				<key>url</key>
				<string>%DOWNLOADURL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
