<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Cyberduck and imports into FileWave</string>
	<key>Identifier</key>
	<string>com.github.thohmann.filewave.MSPowerPoint2016</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft PowerPoint</string>
		<key>LOCALE_ID</key>
		<string>1031</string>
        <key>fw_destination_root</key>
        <string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.install.MSPowerPoint2016</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>/Applications/%NAME%.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>fw_app_bundle_id</string>
					<key>CFBundleVersion</key>
					<string>fw_app_version</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_fileset_name</key>
				<string>%NAME% 365 %version% (Programm)</string>
				<key>fw_import_source</key>
				<string>/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
