<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Teams image and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.thohmann.filewave.MSTeams</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Teams</string>
        <key>fw_destination_root</key>
        <string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.apettinen.download.MSTeams</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Teams_osx_app.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Applications</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/Applications/%NAME%.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
					<key>LSMinimumSystemVersion</key>
					<string>fw_app_minsysversion</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app</string>
				<key>user</key>
				<string>root</string>
				<key>group</key>
				<string>admin</string>
			</dict>
			<key>Processor</key>
			<string>com.github.thohmann.pathchown/PathCHOWN</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%bundleid%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% %version% ab macOS %fw_app_minsysversion% (Programm)</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app</string>
				<key>user</key>
				<string>me</string>
				<key>group</key>
				<string>admin</string>
			</dict>
			<key>Processor</key>
			<string>com.github.thohmann.pathchown/PathCHOWN</string>
		</dict>
	</array>
</dict>
</plist>
