<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of MS Word 2016/365 and imports PKG-file into FileWave</string>
	<key>Identifier</key>
	<string>com.github.thohmann.filewave.SkypeForBusinessPKGFS</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Skype for Business</string>
		<key>LOCALE_ID</key>
		<string>1031</string>
        <key>fw_destination_root</key>
        <string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.SkypeForBusiness</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Merge input pkginfo and additional_pkginfo generated by MSOfficeMacURLandUpdateInfoProvider</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>		
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_fileset_name</key>
				<string>Microsoft Office 365 - %NAME% %version% (Installer)</string>
				<key>fw_import_source</key>
				<string>/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
