<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of DaVinci Studio 19 and imports into FileWave</string>
	<key>Identifier</key>
	<string>com.github.thohmann.filewave.davinciresolve19</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DaVinciResolve19</string>
		<key>REG_CITY</key>
		<string>Offenburg</string>
		<key>REG_COUNTRY</key>
		<string>de</string>
		<key>REG_EMAIL</key>
		<string>armin.keller@burda.com</string>
		<key>REG_FIRSTNAME</key>
		<string>Armin</string>
		<key>REG_LASTNAME</key>
		<string>Keller</string>
		<key>REG_PHONE</key>
		<string>2345678</string>
		<key>REG_STREET</key>
		<string>Hubert Burda Platz 2</string>
		<key>fw_name</key>
		<string>DaVinci Resolve</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.thohmann.download.davinciresolve19</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unzip/*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%found_filename%/*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>com.blackmagicdesign.DaVinciResolve</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%fw_name% %fw_app_version% (PKG)</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
